{
    "items": [
        {
            "name" : "To-do",
            "route": "to-do",
            "icon" : "fas fa-list-ul",
            "description": [
                "I built this application using purely vanilla JavaScript. This was to test my abilities to get around all the problems involved in creating a to-do list without relying on a framework.",
                "Within the application the user has the ability to create new tasks, filter which ones they wish to see on-screen at one time depending on certain criteria and also the ability to remove tasks which are no longer wanted.",
                "The user also has the ability to favourite tasks which will highlight them and bring them to the top of the list. The check boxes are used to mark a list item as completed."
            ],
            "github" : "https://github.com/Havolt/to-do-list"
        },
        {
            "name" : "Tetris",
            "route": "tetris",
            "icon" : "fas fa-gamepad",
            "description": [
                "Note: This game requires use of a keyboard to play.",
                "This application is my version of Tetris. It uses many of the elements seen in common variations of Tetris such as score multipliers for multiple stacks removed at once and the ability to rotate pieces.",
                "There is a timer in the game, along with a list of controls and multiple difficulty levels. I have also implemented a pause timer. I hope you enjoy playing my rendition of this classic video game.",
                "To move the current piece use the left and right arrow keys and to rotate the piece use the 'Z' and 'C' keys."
            ],
            "github" : "https://github.com/Havolt/tetris"
        },
        {
            "name" : "No Context Creepy",
            "route": "nc-creepy",
            "icon" : "fas fa-skull",
            "description": [
                "This application generates randomly selected creepy stories for the user's viewing pleasure.",
                "To generate the stories the app utilizes a Reddit API. It selects a random story from the website which contains set keywords. This helps keep the stories relevant. There it also a few other conditions put in place to try to prevent stories that would be uninteresting from showing up.",
                "I had to work around the syntax in Reddit's comment section to turn user links into clickable ones and to remove some of the garbage values that show up. The user can select between short, long or all length stories.",
                "The earlier 20 stories are saved to a list which the user can scroll through. The app sends requests and preloads data to avoid the user having to wait too long between stories."
            ],
            "github" : "https://github.com/Havolt/redditSearchAPI"
        },
        {
            "name" : "Wikipedia Search",
            "route": "wiki-search",
            "icon" : "fab fa-wikipedia-w",
            "description": [
                "This application is a Wikipedia Search engine which uses the Wikipedia API. When the user enters a search request the the app brings back the 20 most relevant results.",
                "The results are shown in a list and when individual items are clicked they will bring the user to the relevant Wikipedia article. There is also a random article button for the adventurous user."
            ],
            "github" : "https://github.com/Havolt/Wikipedia-Viewer"
        },
        {
            "name" : "Offline Hacker",
            "route": "offline-hacker",
            "icon" : "far fa-keyboard",
            "description": [
                "Note: This game requires a keyboard to play and is best played on screen with a resolution of over 720 x 480.",
                "Offline Hacker was my entry for the JS13kGames competition which is a JavaScript coding competition for HTML5 game developers. The competition hasa rule which limits the size of the entered games to under 13 kilobytes.",
                "Offline Hacker is a typing game. The goal is to prevent the words that appear on-screen from moving all the way to the right hand side of the screen. To do this the player must type the words as fast as they can to destroy them.",
                "The player will have three lives. As the user's score gets higher the game will in-turn keep getting faster. Offline Hacker is drawn to the screen using canvas. I've tried to emulate the aesthetic of older computers with the use of green text on a black background."
            ],
            "github" : "https://github.com/Havolt/mini-projects/tree/master/js13k"
        },
        {
            "name" : "Checkers",
            "route": "checkers",
            "icon" : "fas fa-chess-board",
            "description": [
                "This is my attempt at making the board game checkers/draughts with JavaScript. It uses a lot of common rules found in competitive checkers such as mandatory moves and multiple takes.",
                "The bottom of the app displays who's current move it is and tells if there is currently a mandatory take needed. I hope you enjoy playing."
            ],
            "github" : "https://github.com/Havolt/JSCheckers"
        },
        {
            "name" : "Calculator",
            "route": "calculator",
            "icon" : "fas fa-calculator",
            "description": [
                "This app is a simple calculator. It can string multiple operations together like most modern calculators and displays the previous inputs at the top of the screen. It has the ability to work with decimal numbers and numbers.", 
                "Inputs can be done by either utilizing the face buttons on the calculator or using a keyboard. To clear the screen using the keyboard use the 'Backspace', 'C' or 'Delete' keys."
            ],
            "github" : "https://github.com/Havolt/Calculator"
        },
        {
            "name" : "Previous Portfolio",
            "route": "prev-portfolio",
            "icon" : "fas fa-briefcase",
            "description": [
                "Note: All external functionality has been removed from this older portfolio. My current social media links and contact form are found on the main page of my current portfolio.",
                "I used this portfolio during most of 2018. The design plan was to go for a simple aesthetic and use a single page layout. The site was one of my first attempts at making a responsively designed site for all screen sizes."
            ],
            "github" : "https://github.com/Havolt/portfolio"
        }
    ]
}